{"pageProps":{"abouts":[{"title":"About What is Andy Doing NOW?!","content":{"raw":{"children":[{"type":"code-block","children":[{"text":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hdPSkCT1Y74\"  title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"}]},{"type":"paragraph","children":[{"text":""}]},{"type":"paragraph","children":[{"text":"Suicide and burnout are among the most serious problems facing the veterinary industry today. As veterinary professionals, our passion resides in making a difference by connecting and improving the sacred human-animal bond. However, in recent years, mental health surveys have shown that achieving this ideal vision comes at a great cost. Although we now have a better understanding of the risks facing veterinary professionals, there are still much more to learn regarding the different factors that affect our mental well-being. Understanding the mental health space is extremely important as it can pave a path towards meaningful actions."}]},{"type":"paragraph","children":[{"text":"Dr. Andy Chiang truly believes that veterinary medicine is one of the most amazing professions. Because of that, he was devastated to learn about the shocking statistics on veterinarian suicide and burnout. When he witnessed firsthand burnout from close colleagues, he knew that he had to step up. Since he had little knowledge in the mental health space, Dr. Chiang began his journey by consuming as much content as he could related to the topic. During his quest for answers, Dr. Chiang learned from others with more experiences and knowledge. Dr. Kimberly Pope-Robinson, author of "},{"text":"The Unspoken Life","underline":true},{"text":" and founder of the 1 Life Connected movement, shared her personal struggles and realizations that ultimately led her to support fellow veterinarians. Her concept of balancing “balloons” (things that lift a person up) and “sinker” (things that drag a person down) resonated with Dr. Chiang’s attitude towards well-being. At the Veterinary Well-being Summit, Dr. Chiang learned from mental health professionals and leaders of the profession that made him realize that he’s not alone in the pursuit of a better future."}]},{"type":"paragraph","children":[{"text":"During the time of self-education, Dr. Chiang recognized a few things. First, people in and out of the veterinary profession care deeply about the struggles veterinary professionals are going through, and everyone wants to help. Second, even though our knowledge on well-being have improved in recent years, there are still much more to be explored. Third, the struggle each individual faces is unique in their own way that requires a tailored self-response from within. These three points became the foundation of "},{"text":"What is Andy Doing NOW?!","underline":true},{"text":" as Dr. Chiang contemplated the process to improve well-being."}]},{"type":"paragraph","children":[{"text":"What exactly IS Andy doing now…? He now understands that there is no recipe to advance wellness – everyone has their own way. Dr. Chiang’s goal is to explore activities and events that positively impact a veterinarian’s (and other veterinary professional’s) well-being. In addition, he plans to equip himself with more knowledge as he adventures through the mental health space. He hopes that by sharing what he learns, he can encourage others to join the fight against suicide and burnout."}]}]}}},{"title":"Who is Dr. Andy?","content":{"raw":{"children":[{"type":"heading-two","children":[{"bold":true,"text":"Path to Veterinary Medicine"}]},{"type":"paragraph","children":[{"text":"Dr. Andy Chiang was born in California but spent part of his childhood in Taiwan. Even though he didn’t know it at the time, his time in Taiwan would eventually lead him to a career in veterinary medicine. Growing up in Taiwan, Andy was not allowed to have pets. However, he has always found a strong connection to animals as his favorite annual activity in Taiwan was a trip to the zoo. It wasn’t until he returned to California and had pets that he finally experienced first-hand the sacred human-animal bond. In high school, he developed a passion for science, and along with his love for animals, he thought for the first time “veterinary medicine sounds like an awesome profession.”"}]},{"type":"paragraph","children":[{"text":"Andy’s first job was a kennel assistant at a local animal hospital. That was his first real life experience in the veterinary profession. It was not like anything he imagined. He naively thought that veterinarians look at the pet, prescribe medications, and call it a day. What he witnessed was supreme leadership skills that efficiently delegated tasks. He saw the thorough and detailed thought process that went into every decision-making. He observed the guardian-like charisma that guided pet owners through tough times. He experienced the team effort that nursed sick animals back to health. He would finish his tasks as quickly as possible, just so he could catch the last few minutes of the veterinarian’s surgical procedure. Becoming a veterinarian to young Andy was more than just pursuing a job or a career, it was the closest thing to a superhero; as a kid that had once fawned over comic book superheroes, he knew that he had found his calling. That summer job opened Andy’s eyes and completely changed his perception towards the veterinary profession. Since then, he concentrated on one goal, to become a veterinarian."}]},{"src":"https://media.graphassets.com/9HQa62LzTvS6jOWBVGy9","type":"image","title":"andy-chiang-diesel-mojo.jpeg","width":768,"handle":"9HQa62LzTvS6jOWBVGy9","height":512,"children":[{"text":""}],"mimeType":"image/jpeg"},{"type":"paragraph","children":[{"text":""}]},{"type":"heading-one","children":[{"bold":true,"text":"Love for the Profession"}]},{"type":"paragraph","children":[{"text":"Just when Andy thought that he couldn’t fall in love with the profession more, he entered his dream program at the UC Davis School of Veterinary Medicine with the Class of 2016 (shout out, 2016!). His memory from the very first morning of class still stays vivid even today. He still recalls that prior to the first “lecture”, all the aspiring future veterinarians were getting to know each other in the foyer; the excitement and energy were simply unbelievable. In veterinary school, Andy had the chance to meet like-minded individuals and learn their stories. He was beyond inspired by his peers and their reasons to pursue their veterinary dream. Some of those people would eventually become his closest friends (or even better yet, a family)."}]},{"type":"paragraph","children":[{"text":"Through veterinary school, Andy noticed that the energy and fire that he felt from the first day of school began to dissolve year after year. That drop in energy was especially noticeable during clinical rotation year when he witnessed several classmates break down in tears. He thought that it might have been a phase, and things would improve come commencement. Through collaboration and support, four years quickly went by for the Class of 2016. Commencement ceremony was one of the best times in Andy’s life. On that day, he felt the same energy that he witnessed on day one of school. Everyone seemed to be re-energized and ready to embark on their veterinary journey. Little did he know, that spark would only be transient."}]},{"type":"heading-one","children":[{"bold":true,"text":"Mission: Re-Spark that Passion"}]},{"type":"paragraph","children":[{"text":"Andy accepted a general practice position in Los Angeles after graduation. Although things were going well, his worry grew as several suicide news shocked the profession. He also started to see various articles on the statistics of suicide rate and burnout among veterinarians. He cared for those who hurt and wanted to support them, but had no idea how, so he looked quietly from afar."}]},{"type":"paragraph","children":[{"text":"The sentiment to contribute to mental well-being grew stronger after he reunited with his veterinary school friends. He could clearly see early signs of burnout just a year after graduation, and five short years after that unforgettable first day of class. Andy believes that his colleagues who show signs of fatigue still have the fire and passion for the profession. He knows that because they had deep conversations about their veterinary dreams and aspirations. In addition, he believes in the sacred human-animal bond that drives all veterinarians. However, as he reflected to his own stressful workdays, he understood how easily one can become mentally and physically exhausted in this amazing, yet demanding profession. He decided that he no longer wanted to support from a distance. He wanted to be in the front line to combat this monstrosity that faces his beloved profession."}]},{"type":"paragraph","children":[{"text":"It took Andy eight (relatively) short years to progress from a clueless kennel assistant to a doctor who is capable of performing all of those “superhero” tasks. If he starts now, he figured, “I have (approximately) 40 years until retirement to solve this problem, so why not give a shot?” Even if he can’t solve suicide and burnout during that time, he hopes to push the envelope as far as possible to help those in need. "},{"text":"What is Andy Doing NOW?!","underline":true},{"text":" is one path by which Andy hopes to connect with colleagues around the country (and around the globe) in pursuit of happiness and self-recognition of a passion that interconnects us all."}]}]}}}]},"__N_SSG":true}