{"pageProps":{"post":{"author":{"bio":"Dr. Chiang is a relief veterinarian, web developer, and entrepreneur who believes that the mental wellbeing crisis within the veterinary industry can be drastically improved through exploration and collaboration. In his free time, he is a fitness enthusiast who also enjoys traveling and trying out new food. Oh, he is also a corgi fanatic!","name":"Andy Chiang, DVM","id":"cl5ljc339ha8s0djx8bzl9e4k","photo":{"url":"https://media.graphassets.com/tbyUuQqTcqmDPCOa45bs"}},"publishedAt":"2022-09-02T18:35:12.347927+00:00","slug":"road-trippin-to-tammys-wedding","title":"Road Trippin' to Tammy's Wedding","excerpt":"I try to find any excuse I can to travel. When my awesome college friend, Tammy, invited me to her wedding in Santa Cruz, I looked for ways to maximize my trip.","featuredImage":{"url":"https://media.graphassets.com/3k8kwKViRlanUvrsyMWp"},"categories":[{"name":"Travel","slug":"travel"},{"name":"Videos","slug":"videos"}],"content":{"raw":{"children":[{"type":"code-block","children":[{"text":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/iXq1LcIm9lo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"}]},{"type":"paragraph","children":[{"text":" "}]},{"type":"paragraph","children":[{"text":"I try to find any excuse to travel. When my awesome college friend, Tammy, invited me to her wedding in Santa Cruz, I looked for ways to maximize my trip."}]},{"type":"paragraph","children":[{"text":"I planned for a one-week trip with Mojo. I started from Los Angeles where I house-sat for my parents. My first stop was my best friend's house in San Jose. We spent a good amount of time of catching up and enjoying delicious meals. He had just started remodeling his new house, so I was excited to be there to share that process with him."}]},{"type":"paragraph","children":[{"text":"The wedding was absolutely beautiful. The cherry on top was the boba bar – simply the best wedding idea, ever. I had two jasmine milk teas and took one to go."}]},{"type":"paragraph","children":[{"text":"We drove back to San Jose to catch up with a few more friends and played some golf, then headed back down to our sweet home in San Diego."}]},{"type":"paragraph","children":[{"text":"I enjoy traveling for many reasons. One of those is the chance to reconnect with my friends. They remind me of the things I cherish and appreciate the most about life! "}]},{"type":"paragraph","children":[{"text":"What do you do to spark joy in your life? "}]},{"type":"paragraph","children":[{"text":" "}]},{"type":"paragraph","children":[{"text":""}]},{"type":"paragraph","children":[{"text":"  "}]},{"type":"paragraph","children":[{"text":"["},{"text":"Original post published on 01/15/2019","italic":true},{"text":"]"}]},{"type":"paragraph","children":[{"text":""}]}]}}}},"__N_SSG":true}