{"pageProps":{"abouts":[{"title":"About What is Andy Doing NOW?!","content":{"raw":{"children":[{"type":"code-block","children":[{"text":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hdPSkCT1Y74\"  title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"}]},{"type":"paragraph","children":[{"text":""}]},{"type":"paragraph","children":[{"text":"Suicide and burnout are some of the most serious problems facing the veterinary industry today. As veterinary professionals, our passion resides in connecting and improving the sacred human-animal bond. However, in recent years, "},{"href":"https://www.avma.org/javma-news/2015-04-01/study-1-6-veterinarians-have-considered-suicide#:~:text=Results%20from%20the%20first%20mental,with%20the%20U.S.%20adult%20population.","type":"link","children":[{"text":"mental health studies"}],"openInNewTab":true},{"text":" have shown that achieving this ideal vision comes at a great cost. "}]},{"type":"paragraph","children":[{"text":"Although we now have a better understanding of the risks facing veterinarians, there are still much to learn about the different factors that affect our mental wellbeing. Understanding the mental health space is extremely important as it paves a path towards meaningful actions."}]},{"type":"paragraph","children":[{"text":"Dr. Andy Chiang truly believes that veterinary medicine is the most incredible profession. He was devastated to learn about the "},{"href":"https://www.cdc.gov/media/releases/2018/p1220-veterinarians-suicide.html#:~:text=The%20study%20is%20the%20first,suicide%20as%20the%20general%20population.","type":"link","children":[{"text":"shocking statistics"}],"openInNewTab":true},{"text":" on veterinarian suicide. When he witnessed firsthand burnout from close colleagues, he knew that he had to step up. Since he had little knowledge in the mental health space, Andy began his journey by reaching out to people with personal experiences."}]},{"type":"paragraph","children":[{"text":"Dr. Kimberly Pope-Robinson, author of "},{"href":"https://1lifecc.com/new-book/","type":"link","children":[{"text":"The Unspoken Life","underline":true}],"openInNewTab":true},{"text":" and founder of the "},{"href":"https://1lifecc.com/","type":"link","children":[{"text":"1 Life Connected"}],"openInNewTab":true},{"text":" movement, shared her personal struggles and realizations to support our fellow veterinarians. Her concept of balancing “balloons” (things that lift our spirit) and “sinker” (things that drag us down) resonated with Andy’s attitude towards wellbeing."}]},{"type":"paragraph","children":[{"text":"Andy also attended the "},{"href":"https://www.aaha.org/publications/newstat/articles/2018-03/be-a-part-of-the-solution-at-the-fifth-annual-veterinary-wellbeing-summit/","type":"link","children":[{"text":"Veterinary Wellbeing Summit"}],"openInNewTab":true},{"text":", where he learned from mental health professionals and veterinary leaders. These valuable interactions helped Andy realize that he’s not alone in the pursuit of a better future."}]},{"type":"paragraph","children":[{"text":"Throgh his self-education journey, Andy recognized a few things."}]},{"type":"paragraph","children":[{"text":"First, people in and out of the veterinary industry care deeply about the struggles veterinary professionals are going through, and everyone wants to help. "}]},{"type":"paragraph","children":[{"text":"Second, even though our knowledge on veterinary mental wellness have improved in recent years, there are still much more to be explored. "}]},{"type":"paragraph","children":[{"text":"Third, the struggle each individual faces is unique in their own way that requires a tailored self-response from within. These three points became the foundation of "},{"text":"What is Andy Doing NOW?!","underline":true}]},{"type":"paragraph","children":[{"text":"There is no fixed recipe to advance wellness – everyone has their own unique way. Andy's goal here is to explore activities that positively impact a veterinarian's mental wellbeing. He plans to continue to equip himself with further knowledge as he adventures through the mental health space. He hopes that by sharing what he learns, he can encourage others to join the fight against suicide and burnout."}]}]}}},{"title":"Who is Dr. Andy Chiang?","content":{"raw":{"children":[{"type":"heading-two","children":[{"bold":true,"text":"Path to Veterinary Medicine"}]},{"type":"paragraph","children":[{"text":"Dr. Andy Chiang was born in California but spent part of his childhood in Taiwan. Even though he didn’t know it at the time, his time in Taiwan would eventually lead him to a career in veterinary medicine. Growing up without a pet, he has always found a strong connection to animals through his annual trip to the zoo."}]},{"type":"paragraph","children":[{"text":"It wasn’t until he returned to California that he had his first dog and finally experienced first-hand the sacred human-animal bond that he'd longed for. In high school, he developed a passion for science, and along with his love for animals, he thought for the first time “veterinary medicine sounds like an awesome profession.”"}]},{"type":"paragraph","children":[{"text":"Andy’s first job was a kennel assistant at a local animal hospital. That was his first real life experience in the veterinary profession, and it exceeded every bit of his expectations."}]},{"type":"paragraph","children":[{"text":"He witnessed supreme leadership skills that efficiently delegated tasks. He saw the thorough and detailed thought process that went into every decision. He observed the guardian-like charisma that guided pet owners through tough times. He experienced the team effort that nursed sick animals back to health. He cherished every moment in the surgery suite, even it's just the last few minutes of a routine procedure."}]},{"type":"paragraph","children":[{"text":"Becoming a veterinarian to young Andy was more than just pursuing a job or a career, it was the closest thing to a superhero; as a kid that had once fawned over comic book superheroes, he knew that he had found his calling. That summer job opened Andy’s eyes and completely changed his perception towards the veterinary profession. Since then, he concentrated on one goal, to become a veterinarian."}]},{"src":"https://media.graphassets.com/jEVTLV4Qai6gLuJEC6zZ","type":"image","title":"diesel-mojo.jpg","width":850,"handle":"jEVTLV4Qai6gLuJEC6zZ","height":566,"children":[{"text":""}],"mimeType":"image/jpeg"},{"type":"paragraph","children":[{"text":""}]},{"type":"heading-one","children":[{"bold":true,"text":"Love for the Profession"}]},{"type":"paragraph","children":[{"text":"Just when Andy thought that he couldn’t fall in love with the profession more, he entered his dream program at the "},{"href":"https://www.vetmed.ucdavis.edu/","type":"link","children":[{"text":"UC Davis School of Veterinary Medicine"}],"openInNewTab":true},{"text":" with the Class of 2016 (shout out, 2016!). His memory from the very first morning of class still stays vivid even today. He still recalls that prior to the first lecture, all the aspiring veterinarians were getting to know each other. The excitement and energy were simply unbelievable."}]},{"type":"paragraph","children":[{"text":"In veterinary school, Andy had the chance to meet like-minded individuals and learn their stories. He was beyond inspired by his peers and their reasons to pursue their veterinary dream. Some of those people would eventually become his closest friends, or even better yet, a family."}]},{"type":"paragraph","children":[{"text":"Through veterinary school, Andy noticed that the energy and fire that he felt from the first day of school began to dwindle year after year. That drop in energy was especially noticeable during their clinical year when he saw several classmates break down in tears. He thought that it might have been a phase, and things would improve come commencement."}]},{"type":"paragraph","children":[{"text":"Through collaboration and support, four years quickly went by for the Class of 2016. Commencement ceremony was one of the best times in Andy’s life. On that day, he felt the same energy that he witnessed on day one of school. Everyone seemed to be re-energized and ready to embark on their veterinary journey. Little did he know, that spark would only be transient."}]},{"type":"heading-one","children":[{"bold":true,"text":"Mission: Re-Spark that Passion"}]},{"type":"paragraph","children":[{"text":"Andy accepted a general practice position in Los Angeles after graduation. Although things were going well, his worry grew as several suicide news shocked the profession. He also started to see various articles on the statistics of suicide rate and burnout among veterinarians. He cared for those who hurt and wanted to support them, but had no idea how, so he looked quietly from afar."}]},{"type":"paragraph","children":[{"text":"The sentiment to contribute to the mental wellness space grew stronger after he reunited with his veterinary school friends. He could clearly see early signs of burnout just a year after graduation, and five short years after that unforgettable first day of class. "}]},{"type":"paragraph","children":[{"text":"Despite the grind, Andy knows that his peers still have the fire and passion for the profession. In addition, he believes in the sacred human-animal bond that drives all veterinarians. However, as he reflected on his own stressful workdays, he understood how easily one can become mentally and physically exhausted in this amazing, yet demanding profession. He decided that he no longer wanted to support from a distance. He wanted to be in the front line to combat this monstrosity that faces his beloved profession."}]},{"type":"paragraph","children":[{"text":"It took Andy eight (relatively) short years to progress from a clueless kennel assistant to a doctor who is capable of performing all those superhero tasks that he onces dreamed of."}]},{"type":"paragraph","children":[{"text":"“I still have decades to contribute to solutions for this massive problem, so why not give a shot?” he thought. Even if he can’t solve suicide and burnout during that time, he hopes to push the envelope as far as possible to help those in need. "}]},{"type":"paragraph","children":[{"text":"What is Andy Doing NOW?!","underline":true},{"text":" is one path by which Andy hopes to connect with colleagues around the country (and around the globe) in pursuit of happiness and self-recognition of a passion that interconnects us all."}]}]}}}]},"__N_SSG":true}